In [ ]:
import pandas as pd
import numpy as np

"""
Practice Exercise: Pandas Basics
install pandas, numpy, openpyxl

Complete each function below by following the TODO instructions. 
Each function includes the objective of the task and the expected output.

Use Pandas official documentation for reference.
https://pandas.pydata.org/docs/user_guide/index.html
"""

In [ ]:
"""
Objective: Convert data list into a Pandas DataFrame
"""
name = ["John Doe", "Nadia", "Serena", "Tessa", "Una"]
age = [25, 31, 23, 17, 23]
city = ["New York", "London", "Paris", "Tokyo", "Sydney"]

data = {"name": name, "age": age, "city": city}
df = pd.DataFrame(data)
print(df)
print(type(df))

       name  age      city
0  John Doe   25  New York
1     Nadia   31    London
2    Serena   23     Paris
3     Tessa   17     Tokyo
4       Una   23    Sydney
<class 'pandas.core.frame.DataFrame'>

In [20]:
"""
Objective: Convert data dictionaries into a Pandas DataFrame
"""
dict_1 = {"name": "John Doe", "age": 25, "city": "New York"}
dict_2 = {"name": "Nadia", "age": 31, "city": "London"}
dict_3 = {"name": "Serena", "age": 23, "city": "Paris"}
dict_4 = {"name": "Tessa", "age": 17, "city": "Tokyo"}
dict_5 = {"name": "Una", "age": 23, "city": "Sydney"}

data = [dict_1, dict_2, dict_3, dict_4, dict_5]
df = pd.DataFrame(data)
print(df)
print(type(df))

       name  age      city
0  John Doe   25  New York
1     Nadia   31    London
2    Serena   23     Paris
3     Tessa   17     Tokyo
4       Una   23    Sydney
<class 'pandas.core.frame.DataFrame'>

In [9]:
"""
Objective: Adding new columns to a Pandas DataFrame
"""
is_married = [True, False, False, False, True]
df["is_married"] = is_married
df

       name  age      city  is_married
0  John Doe   25  New York        True
1     Nadia   31    London       False
2    Serena   23     Paris       False
3     Tessa   17     Tokyo       False
4       Una   23    Sydney        True

In [14]:
"""
Objective: Adding new rows to a Pandas DataFrame
"""
new_row = {"name": "Victoria", "age": 30, "city": "New York", "is_married": True}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

df

       name  age      city  is_married
0  John Doe   25  New York        True
1     Nadia   31    London       False
2    Serena   23     Paris       False
3     Tessa   17     Tokyo       False
4       Una   23    Sydney        True
5  Victoria   30  New York        True
6  Victoria   30  New York        True

In [21]:
""" 
Objective: Renaming columns
"""
df = df.rename(columns={"name": "full_name"})
df

  full_name  age      city
0  John Doe   25  New York
1     Nadia   31    London
2    Serena   23     Paris
3     Tessa   17     Tokyo
4       Una   23    Sydney

In [13]:
"""
Objective: Print subsets of a Pandas DataFrame
"""

print(df["name"])
print("________________________________________")
print(df.iloc[0])
print("________________________________________")
print(df.loc[0])
print("________________________________________")

0    John Doe
1       Nadia
2      Serena
3       Tessa
4         Una
5    Victoria
Name: name, dtype: object
________________________________________
name          John Doe
age                 25
city          New York
is_married        True
Name: 0, dtype: object
________________________________________
name          John Doe
age                 25
city          New York
is_married        True
Name: 0, dtype: object
________________________________________

In [15]:
"""
Objective: Export as CSV
"""
df.to_csv("data.csv")

In [17]:
"""
Objective: Export as Excel without index
"""
df.to_excel("data.xlsx")

In [19]:
""" 
Objective: Export with multiple sheets
"""
writer = pd.ExcelWriter("data.xlsx")
df.to_excel(writer, sheet_name="Sheet1")
df.to_excel(writer, sheet_name="Sheet2")